#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_cloudwatch_log_group.cognito_define_auth_challenge_log_group: Refreshing state... [id=/aws/lambda/cognito_define_auth_challenge]
aws_cognito_user_pool.cognito_user_pool: Refreshing state... [id=sa-east-1_af5EaSTDN]
aws_cloudwatch_log_group.cognito_verify_auth_challenge_log_group: Refreshing state... [id=/aws/lambda/cognito_verify_auth_challenge]
aws_cloudwatch_log_group.cognito_pre_signup_log_group: Refreshing state... [id=/aws/lambda/cognito_pre_signup]
aws_s3_bucket.cognito_passwordless_signin_lambda_deploys: Refreshing state... [id=cognito-passwordless-signin-lambda-deploys]
aws_cloudwatch_log_group.cognito_create_auth_challenge_log_group: Refreshing state... [id=/aws/lambda/cognito_create_auth_challenge]
aws_s3_bucket_versioning.cognito_passwordless_signin_lambda_deploys_versioning: Refreshing state... [id=cognito-passwordless-signin-lambda-deploys]
aws_s3_bucket_public_access_block.cognito_passwordless_signin_lambda_deploys_public_access_block: Refreshing state... [id=cognito-passwordless-signin-lambda-deploys]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_cloudwatch_log_group.cognito_create_auth_challenge_log_group has changed
  ~ resource "aws_cloudwatch_log_group" "cognito_create_auth_challenge_log_group" {
        id                = "/aws/lambda/cognito_create_auth_challenge"
        name              = "/aws/lambda/cognito_create_auth_challenge"
      + tags              = {}
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.cognito_define_auth_challenge_log_group has changed
  ~ resource "aws_cloudwatch_log_group" "cognito_define_auth_challenge_log_group" {
        id                = "/aws/lambda/cognito_define_auth_challenge"
        name              = "/aws/lambda/cognito_define_auth_challenge"
      + tags              = {}
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.cognito_pre_signup_log_group has changed
  ~ resource "aws_cloudwatch_log_group" "cognito_pre_signup_log_group" {
        id                = "/aws/lambda/cognito_pre_signup"
        name              = "/aws/lambda/cognito_pre_signup"
      + tags              = {}
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.cognito_verify_auth_challenge_log_group has changed
  ~ resource "aws_cloudwatch_log_group" "cognito_verify_auth_challenge_log_group" {
        id                = "/aws/lambda/cognito_verify_auth_challenge"
        name              = "/aws/lambda/cognito_verify_auth_challenge"
      + tags              = {}
        # (3 unchanged attributes hidden)
    }

  # aws_cognito_user_pool.cognito_user_pool has changed
  ~ resource "aws_cognito_user_pool" "cognito_user_pool" {
      + auto_verified_attributes  = []
        id                        = "sa-east-1_af5EaSTDN"
        name                      = "cognito-passwordless-user-pool"
      + tags                      = {}
        # (7 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_s3_bucket.cognito_passwordless_signin_lambda_deploys has changed
  ~ resource "aws_s3_bucket" "cognito_passwordless_signin_lambda_deploys" {
        id                                   = "cognito-passwordless-signin-lambda-deploys"
        tags                                 = {
            "Name" = "cognito-passwordless-signin-lambda-deploys"
        }
      ~ versioning                           = [
          ~ {
              ~ enabled    = false -> true
                # (1 unchanged element hidden)
            },
        ]
        # (18 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.cognito_create_auth_challenge_role will be created
  + resource "aws_iam_role" "cognito_create_auth_challenge_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cognito_create_auth_challenge_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.cognito_define_auth_challenge_role will be created
  + resource "aws_iam_role" "cognito_define_auth_challenge_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:sa-east-1:357732810582:*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:sa-east-1:357732810582:log-group:/aws/lambda/cognito_define_auth_challenge:*"
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + s3:ResourceAccount = "357732810582"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::cognito-passwordless-signin-lambda-deploys/cognito_verify_auth_challenge"
                    },
                  + {
                      + Action    = "lambda:InvokeFunction"
                      + Condition = {
                          + ArnLike = {
                              + AWS:SourceArn = "arn:aws:cognito-idp:sa-east-1:357732810582:userpool/sa-east-1_af5EaSTDN"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cognito-idp.amazonaws.com"
                        }
                      + Resource  = "arn:aws:lambda:sa-east-1:357732810582:function:cognito_verify_auth_challenge"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cognito_define_auth_challenge_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.cognito_pre_signup_role will be created
  + resource "aws_iam_role" "cognito_pre_signup_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:sa-east-1:357732810582:*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:sa-east-1:357732810582:log-group:/aws/lambda/cognito_pre_signup:*"
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + s3:ResourceAccount = "357732810582"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::cognito-passwordless-signin-lambda-deploys/cognito_verify_auth_challenge"
                    },
                  + {
                      + Action    = "lambda:InvokeFunction"
                      + Condition = {
                          + ArnLike = {
                              + AWS:SourceArn = "arn:aws:cognito-idp:sa-east-1:357732810582:userpool/sa-east-1_af5EaSTDN"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cognito-idp.amazonaws.com"
                        }
                      + Resource  = "arn:aws:lambda:sa-east-1:357732810582:function:cognito_verify_auth_challenge"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cognito_pre_signup_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.cognito_verify_auth_challenge_role will be created
  + resource "aws_iam_role" "cognito_verify_auth_challenge_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:sa-east-1:357732810582:*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:sa-east-1:357732810582:log-group:/aws/lambda/cognito_verify_auth_challenge:*"
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + s3:ResourceAccount = "357732810582"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::cognito-passwordless-signin-lambda-deploys/cognito_verify_auth_challenge"
                    },
                  + {
                      + Action    = "lambda:InvokeFunction"
                      + Condition = {
                          + ArnLike = {
                              + AWS:SourceArn = "arn:aws:cognito-idp:sa-east-1:357732810582:userpool/sa-east-1_af5EaSTDN"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cognito-idp.amazonaws.com"
                        }
                      + Resource  = "arn:aws:lambda:sa-east-1:357732810582:function:cognito_verify_auth_challenge"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cognito_verify_auth_challenge_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_lambda_function.cognito_create_auth_challenge will be created
  + resource "aws_lambda_function" "cognito_create_auth_challenge" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cognito_create_auth_challenge"
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "provided.al2"
      + s3_bucket                      = "cognito-passwordless-signin-lambda-deploys"
      + s3_key                         = "cognito_create_auth_challenge"
      + s3_object_version              = "latest"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.cognito_define_auth_challenge will be created
  + resource "aws_lambda_function" "cognito_define_auth_challenge" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cognito_define_auth_challenge"
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "provided.al2"
      + s3_bucket                      = "cognito-passwordless-signin-lambda-deploys"
      + s3_key                         = "cognito_define_auth_challenge"
      + s3_object_version              = "latest"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.cognito_pre_signup will be created
  + resource "aws_lambda_function" "cognito_pre_signup" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cognito_pre_signup"
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "provided.al2"
      + s3_bucket                      = "cognito-passwordless-signin-lambda-deploys"
      + s3_key                         = "cognito_pre_signup"
      + s3_object_version              = "latest"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.cognito_verify_auth_challenge will be created
  + resource "aws_lambda_function" "cognito_verify_auth_challenge" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cognito_verify_auth_challenge"
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "provided.al2"
      + s3_bucket                      = "cognito-passwordless-signin-lambda-deploys"
      + s3_key                         = "cognito_verify_auth_challenge"
      + s3_object_version              = "latest"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_ses_email_identity.ses_email_identity will be created
  + resource "aws_ses_email_identity" "ses_email_identity" {
      + arn   = (known after apply)
      + email = "brunotj2015@hotmail.com"
      + id    = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @PoorlyDefinedBehaviour, Action: `pull_request`*